{
   "Name": "MentalEdge.BeginnerServer",
   "Description": "Tools(tool) for running a northstar server for beginners",
   "LoadPriority": 2,
   "RequiredOnClient": false,
   "Version": "2.0.2",

   "ConVars": [
      {
         "Name": "bs_chat_tips",
         "DefaultValue": "1" // If set to 1, the server will occasionally povide random titanfall tips in the chat. You can add your own tips in the respective .nut file.
      },
      {
         "Name": "bs_banhammer",
         "DefaultValue": "1" // Set to 1 to enable the banhammer. The banhammer is a tool that kicks or bans players it evaluates to be too skilled for the server.
      },
      {
         "Name": "bs_statscollector",
         "DefaultValue": "0" // Enable the statcollector
      },
      {
         "Name": "bs_kill_limit",
         "DefaultValue": "17" // Kill limit. The amount of kills needed to ascend pilots, ban, or kick them, because they are skilled enough that they should move on to normal servers. Crossing this limit will still allow finishing the match. The player will even get a congratulatory message at the end!!
      },
      {
         "Name": "bs_kd_limit",
         "DefaultValue": "2.2" // KD limit. The minimum KD needed for pilots to become ascended. Note that neither limit alone is enough for an ascension, both conditions have to be met for a pilot to ascend.
      },
      {
         "Name": "bs_stompkill_limit",
         "DefaultValue": "26" // A limit at which pilots will be banned, unless at a KD close to 1.0. Use to remove veterans stomping on the server. The mod will also ban someone mid-game, who is on track to achieve this killcount by the end of the match, though it errs on the side of caution in these cases.
      },
      {
         "Name": "bs_stompkd_limit",
         "DefaultValue": "3.2" // A hardish limit at which pilots will be instabanned. Unlike the ascension limit, if either this or the killcount condition is met, a ban is issued. The banhammer will allow early game KD to spike above this limit, but as more kills and deaths are accrued, it will activate closer to this treshold.
      },
      {
         "Name": "bs_kd_maxspike",
         "DefaultValue": "10" // The maximum KD spike allowed. Should be fairly high so a as to avoid banning someone getting a titan early and thereby racking up kills without any deaths.
      },
      {
         "Name": "bs_minimumkills",
         "DefaultValue": "8" // Minimum number of kills required before any banhammer action. Increase this to reduce early game or mid game join false positives.
      },
      {
         "Name": "bs_ban_ascended",
         "DefaultValue": "2" // The number of matches an ascended player is blocked from rejoining.
      },
      {
         "Name": "bs_ban_stompers",
         "DefaultValue": "6" // The number of matches a stomping player is blocked from rejoining.
      },
      {
         "Name": "bs_repeat_ascenders",
         "DefaultValue": "2" // Severity of the exponential bans issued to repeat offenders. 2 means that each time the same player gets themselves banned, the added ban duration doubles. (does not start from doubling the base ban duration)
      }
   ],

   "Scripts": [
      {
         "Path": "banhammer.nut",
         "RunOn": "( SERVER ) && MP",
         "ServerCallback": {
            "After": "BanHammerInit"
         }
      },
      {
         "Path": "chattips.nut",
         "RunOn": "( SERVER ) && MP",
         "ServerCallback": {
            "After": "TipsInit"
         }
      },
      {
         "Path": "statscollector.nut",
         "RunOn": "( SERVER ) && MP",
         "ServerCallback": {
            "After": "StatsInit"
         }
      }
   ]
}
